src/t1/app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order("created_at ASC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at ASC

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "description", "body", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dasd"], ["description", ""], ["body", ""], ["author", ""], ["created_at", "2017-10-18 15:09:33.304803"], ["updated_at", "2017-10-18 15:09:33.304803"]]

	def update
		if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "description" = $2, "body" = $3, "author" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["title", "dasdasfsd"], ["description", "dasfsddas"], ["body", "adasdsafsdfs"], ["author", "dasdfsdfds"], ["updated_at", "2017-10-18 18:45:21.068122"], ["id", 6]]

	def find_post
		@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]